In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [14]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna(inplace = True)

In [12]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
data.fillna(0)

0    1.0
1    0.0
2    3.5
3    0.0
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data.fillna({1:0, 2: 1, 0: 3})

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  1.0
2  3.0  0.0  1.0
3  3.0  6.5  3.0

In [27]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [29]:
data.dropna(how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [31]:
data[4] = NA

In [33]:
data.dropna(how = "all", axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [34]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [35]:
df

          0         1         2
0  0.539272       NaN       NaN
1  0.828700       NaN       NaN
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [41]:
df.dropna(thresh = 2)

          0         1         2
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [43]:
df.fillna(0)

          0         1         2
0  0.539272  0.000000  0.000000
1  0.828700  0.000000  0.000000
2  0.565848  0.000000  1.761702
3 -0.683176  0.000000  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [44]:
df.fillna({1 : 5,2 : 9, 0 : 3})

          0         1         2
0  0.539272  5.000000  9.000000
1  0.828700  5.000000  9.000000
2  0.565848  5.000000  1.761702
3 -0.683176  5.000000  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [46]:
df.fillna(method = "ffill")

          0         1         2
0  0.539272       NaN       NaN
1  0.828700       NaN       NaN
2  0.565848       NaN  1.761702
3 -0.683176       NaN  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [47]:
df.fillna(method = "bfill")

          0         1         2
0  0.539272 -0.005775  1.761702
1  0.828700 -0.005775  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [49]:
df.fillna(method = "bfill", limit = 2, inplace = True)

In [50]:
df

          0         1         2
0  0.539272       NaN  1.761702
1  0.828700       NaN  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [51]:
df.fillna(df.mean())

          0         1         2
0  0.539272  0.463194  1.761702
1  0.828700  0.463194  1.761702
2  0.565848 -0.005775  1.761702
3 -0.683176 -0.005775  0.355287
4  0.445936 -0.005775 -0.017751
5  1.251529  1.715555 -0.923119
6  0.078109  0.617741 -0.283488

In [54]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [55]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [58]:
data[data.duplicated()]

    k1  k2
6  two   4

In [59]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [60]:
 data['v1'] = range(7)

In [61]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [62]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [64]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [66]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [67]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [68]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [69]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [70]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [ ]:
lowercased = data['food'].str.lower()

In [72]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [74]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [76]:
data['animal'] = lowercased.map(meat_to_animal)

In [77]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [79]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [80]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [82]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [83]:
data.replace([-999,-1000],[4,5])

0    1.0
1    4.0
2    2.0
3    4.0
4    5.0
5    3.0
dtype: float64

In [84]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [85]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [87]:
data.rename(index= str.lower, columns = str.upper)

          ONE  TWO  THREE  FOUR
ohio        0    1      2     3
colorado    4    5      6     7
new york    8    9     10    11

In [90]:
data.rename(index = {'Ohio' : 'karachi'}, columns = {'three' : 'peshawar'})

          one  two  peshawar  four
karachi     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [97]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32,18]

In [98]:
bins = [18, 25, 35, 60, 100]
#cats = pd.cut(ages, bins)

In [99]:
bins

[18, 25, 35, 60, 100]

In [100]:
cats = pd.cut(ages, bins)

In [101]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60.0, 100.0], (35.0, 60.0], (35.0, 60.0], (25.0, 35.0], NaN]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [102]:
cats.codes

array([ 0,  0,  0,  1,  0,  0,  2,  1,  3,  2,  2,  1, -1], dtype=int8)

In [103]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [108]:
cats.dtype

CategoricalDtype(categories=[(18, 25], (25, 35], (35, 60], (60, 100]],
              ordered=True)